Imports

In [114]:
import os
import pandas as pd
import numpy as np
#import opendatasets as od

ModuleNotFoundError: No module named 'opendatasets'

Carregando os dados

In [101]:
#TODO baixar os dados
#url = 'https://storage.googleapis.com/kaggle-data-sets/29/2150/bundle/archive.zip?X-Goog-Algorithm=GOOG4-RSA-SHA256&X-Goog-Credential=gcp-kaggle-com%40kaggle-161607.iam.gserviceaccount.com%2F20210704%2Fauto%2Fstorage%2Fgoog4_request&X-Goog-Date=20210704T195004Z&X-Goog-Expires=259199&X-Goog-SignedHeaders=host&X-Goog-Signature=7c5e07949c0b5fb669328c36b8975f7e09fbd85c0c8f6f77c3fcc04feee0a630e5da4e00fd6038cf26950757a10a0a48634cc5d083864edf71d54bdd8feaeb7c171d168c151a261feb6493ae13a264592ece69b9a0ae4bcd56bd2b60b4e0d42512149b46cd27e08ec1eeef976b1e44792b5840baf26560e714b198ac130f083dd1b3f12178760587adbaf53210e4ae75998403dc32cb946d01506f177db8bdafc2f4086af64ef354d5511e09f01dd84f6cc68ae43a642ba2cb5d90aad5d4ede3858cb2b16dcc9058da3c5f3354f65cf19b9b06d2a293ef0676f3139b342b695a947eb40bff13b41dd90efab8484602bcab894975c7f98de215a67d0878ffda83'


#if not os.path.exists("data"):
#    os.mkdir("data")
#    !cd data && kaggle datasets download -d berkeleyearth/climate-change-earth-surface-temperature-data

In [102]:
dataset_temperatures_by_city = pd.read_csv("data/GlobalLandTemperaturesByCity.csv")
dataset_temperatures_by_country = pd.read_csv("data/GlobalLandTemperaturesByCountry.csv")
dataset_temperatures_by_city.head(10)

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
5,1744-04-01,5.788,3.624,Århus,Denmark,57.05N,10.33E
6,1744-05-01,10.644,1.283,Århus,Denmark,57.05N,10.33E
7,1744-06-01,14.051,1.347,Århus,Denmark,57.05N,10.33E
8,1744-07-01,16.082,1.396,Århus,Denmark,57.05N,10.33E
9,1744-08-01,NaN,NaN,Århus,Denmark,57.05N,10.33E

Corrigindo os tipos

In [103]:
dataset_temperatures_by_city.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8599212 entries, 0 to 8599211
Data columns (total 7 columns):
 #   Column                         Dtype
---  ------                         -----
 0   dt                             object
 1   AverageTemperature             float64
 2   AverageTemperatureUncertainty  float64
 3   City                           object
 4   Country                        object
 5   Latitude                       object
 6   Longitude                      object
dtypes: float64(2), object(5)
memory usage: 459.2+ MB

In [104]:
dataset_temperatures_by_city['dt'] = pd.to_datetime(dataset_temperatures_by_city['dt'])
dataset_temperatures_by_city['City'] = dataset_temperatures_by_city.City.astype('category')
dataset_temperatures_by_city['Country'] = dataset_temperatures_by_city.Country.astype('category')

In [105]:
dataset_temperatures_by_country.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 577462 entries, 0 to 577461
Data columns (total 4 columns):
 #   Column                         Non-Null Count   Dtype
---  ------                         --------------   -----
 0   dt                             577462 non-null  object
 1   AverageTemperature             544811 non-null  float64
 2   AverageTemperatureUncertainty  545550 non-null  float64
 3   Country                        577462 non-null  object
dtypes: float64(2), object(2)
memory usage: 17.6+ MB

In [106]:
dataset_temperatures_by_country['dt'] = pd.to_datetime(dataset_temperatures_by_country['dt'])
dataset_temperatures_by_country['Country'] = dataset_temperatures_by_country.Country.astype('category')

Juntando os datasets de cidade e país pelos campos 'Country' e 'dt'

In [107]:
merged_df = pd.merge(dataset_temperatures_by_city, dataset_temperatures_by_country, left_on=['Country', 'dt'], right_on=['Country', 'dt'])
merged_df.head(10)

,dt,AverageTemperature_x,AverageTemperatureUncertainty_x,City,Country,Latitude,Longitude,AverageTemperature_y,AverageTemperatureUncertainty_y
0,1823-01-01,-5.989,2.775,Århus,Denmark,57.05N,10.33E,-29.446,3.646
1,1823-01-01,-5.989,2.775,Aalborg,Denmark,57.05N,10.33E,-29.446,3.646
2,1823-01-01,-6.889,3.444,Copenhagen,Denmark,55.45N,11.34E,-29.446,3.646
3,1823-01-01,-6.889,3.444,Odense,Denmark,55.45N,11.34E,-29.446,3.646
4,1823-02-01,-2.060,2.938,Århus,Denmark,57.05N,10.33E,-31.746,3.438
5,1823-02-01,-2.060,2.938,Aalborg,Denmark,57.05N,10.33E,-31.746,3.438
6,1823-02-01,-1.709,2.864,Copenhagen,Denmark,55.45N,11.34E,-31.746,3.438
7,1823-02-01,-1.709,2.864,Odense,Denmark,55.45N,11.34E,-31.746,3.438
8,1823-03-01,1.957,2.084,Århus,Denmark,57.05N,10.33E,-28.439,2.757
9,1823-03-01,1.957,2.084,Aalborg,Denmark,57.05N,10.33E,-28.439,2.757

In [108]:
len(merged_df)

8418686

Renomeando as colunas do merge

In [109]:
merged_df = merged_df.rename(columns={'AverageTemperature_x': 'AverageTemperature_city', 'AverageTemperature_y': 'AverageTemperature_country', 'AverageTemperatureUncertainty_x': "AverageTemperatureUncertainty_city", "AverageTemperatureUncertainty_y" : "AverageTemperatureUncertainty_country"})
merged_df.head(1)

,dt,AverageTemperature_city,AverageTemperatureUncertainty_city,City,Country,Latitude,Longitude,AverageTemperature_country,AverageTemperatureUncertainty_country
0,1823-01-01,-5.989,2.775,Århus,Denmark,57.05N,10.33E,-29.446,3.646

Removendo entradas duplicadas

In [110]:
merged_df.drop_duplicates(keep=False, inplace=True)
len(merged_df)

8418686

Remove entradas com mesma data e cidade mas temperaturas diferentes.
City é usado por que Latitude e Longitude estão representadas com um precisão baixa o que acaba excluindo cidades muito proximas, exemplo: cidades conurbadas.

In [111]:
merged_df.drop_duplicates(keep=False, inplace=True, subset=['dt', 'City', 'Latitude', 'Longitude'])
len(merged_df)

8418686

In [113]:
merged_df.head(10)

,dt,AverageTemperature_city,AverageTemperatureUncertainty_city,City,Country,Latitude,Longitude,AverageTemperature_country,AverageTemperatureUncertainty_country
0,1823-01-01,-5.989,2.775,Århus,Denmark,57.05N,10.33E,-29.446,3.646
1,1823-01-01,-5.989,2.775,Aalborg,Denmark,57.05N,10.33E,-29.446,3.646
2,1823-01-01,-6.889,3.444,Copenhagen,Denmark,55.45N,11.34E,-29.446,3.646
3,1823-01-01,-6.889,3.444,Odense,Denmark,55.45N,11.34E,-29.446,3.646
4,1823-02-01,-2.060,2.938,Århus,Denmark,57.05N,10.33E,-31.746,3.438
5,1823-02-01,-2.060,2.938,Aalborg,Denmark,57.05N,10.33E,-31.746,3.438
6,1823-02-01,-1.709,2.864,Copenhagen,Denmark,55.45N,11.34E,-31.746,3.438
7,1823-02-01,-1.709,2.864,Odense,Denmark,55.45N,11.34E,-31.746,3.438
8,1823-03-01,1.957,2.084,Århus,Denmark,57.05N,10.33E,-28.439,2.757
9,1823-03-01,1.957,2.084,Aalborg,Denmark,57.05N,10.33E,-28.439,2.757